{
    "Rick Astley": "1 BILLION views for Never Gonna Give You Up!  Amazing, crazy, wonderful! Rick ️",
    "July is Online": "Jokes on you I love this song\n\nNow where's my free iPhone",
    "haz3rz": "I just love the track",
    "only you": "old memories song",
    "Human": "A legend",
    "Svarliverchik": "Rickroll me, I want to listen to this always",
    "Jessica Veiga": "timeless classic",
    "fox mccloud93": "The 172,000 people who disliked this video are only mad because they've been rick rolled.",
    "pte": "This song also became a memory..",
    "Stay C Vitamin C": "Ah.. It feels like Japanese city pop, but the sensibility is kind of fuzzy.. I like it!",
    "Laura Vargas": "I'm a millennial but I love these songs this is good music <3",
    "Alexia🇲🇳": "My 1% of battery that I have left I'm going to spend it listening to this great song",
    "Cinematic Captures": "Wait this isn’t How To Rickroll People Tutorial.",
    "THANKS MEMES": "Fun fact: The second  person who got rickrolled was Rick's editor.\n\nSo many likes",
    "Its Thlippery": "I used to get mad about getting rickrolled but now I'm liking it.",
    "Diablo [GMD]": "The beginning is the best thing that happened to me...",
    "Greg Timisto": "Came back here to remember the old days and their fashion...",
    "MihaMor": "Strange, why 1.3 billion views? Everyone I know knows this song and loves it.",
    "ThisRandomAnge": "I love this song it's just a classic I've heard it before this rickroll thing but it's still one of my favorites",
    "Luciano Martinez": "I just got rickrolled but I remembered that I really like this song so I watched it till the end, I'm immune to rickrolls",
    "Mr.phantump": "The song is just great",
    "Alex Doak": "May the rick roll never end!!!",
    "Ryan_ Dy": "It is still a great song despite the passing of the years",
    "no one about 😎": "Nostalgia",
    "Ihor Vasylkiv": "SUPER!!",
    "Lazovets": "all memes aside, i just come here to listen to it because its good.",
    "Emilia Groncka": "I love this song",
    "MrAlanZ": "He never gave up\nHe never let us down \nHe never run around and desert us \nHe never made us cry",
    "Negative Bricks": "still a classic roll or not im sitting trough the whole thing",
    "Kira Dushinova": "Since then the song is still good",
    "JBT": "Rick, this is an absolute masterpiece. It deserves the views it has, great work!",
    "areh_ that's it": "The rickroll will be the most historical thing in the world",
    "Aaron David Vera Cevallos": "It's wonderful the 80s era",
    "magpie0430": "genuinely forgot about this im actually impressed i fell for it again",
    "Mateo Granata": "Tremendo Rickroll Wacho",
    "STP": "I've been caught from Japan, but\nA song I've loved since then.",
    "Itz Nuub": "When people don't want to rickroll me, I'll just rickroll myself.",
    "General Kenobi": "Wait this isn't how to beat Matt from Wii Sports",
    "Guilherme Santos": "So this is the manual... How beautiful",
    "DVK14": "1.3 billion views)\nto go nuts)"
}